unfdemo.BS_Billing/src/InformationRegisters/BS_ЗарегистрированныеОбъектыБиллинга/BS_ЗарегистрированныеОбъектыБиллинга.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>BS_ЗарегистрированныеОбъектыБиллинга</name>
  <informationRegisterPeriodicity>Day</informationRegisterPeriodicity>
  <resources>
    <name>СрокОплатыПокупателя</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>ДатаОстановки</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </resources>
  <dimensions>
    <name>Объект</name>
    <type>
      <types>DocumentRef.СчетНаОплату</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

unfdemo.BS_Billing/src/CommonModules/BS_БиллингКлиентСервер/Module.bsl
#Если не Вебклиент и Не ТонкийКлиент И НЕ ТолстыйКлиентУправляемоеПриложение Тогда
	
Процедура ВыполнитьБиллинг(НастройкаБиллинга) Экспорт
	Если НЕ НастройкаБиллинга.ПометкаУдаления Тогда
		НастройкаДнейОповещений = НастройкаБиллинга.Настройки.Получить().ДниОповещенияКонтрагентов;
		Шаблон = НастройкаБиллинга.ШаблонСообщения;
		
		Запрос = Новый Запрос;
		Запрос.Текст =
			"ВЫБРАТЬ
			|	ВТНастройкиДнейОповещения.День КАК День
			|ПОМЕСТИТЬ ВТНастройкиДнейОповещения
			|ИЗ
			|	&ВТНастройкиДнейОповещения КАК ВТНастройкиДнейОповещения
			|ГДЕ
			|	ВТНастройкиДнейОповещения.Пометка = ИСТИНА
			|;
			|
			|////////////////////////////////////////////////////////////////////////////////
			|ВЫБРАТЬ
			|	BS_ЗарегистрированныеОбъектыБиллинга.Объект,
			|	РАЗНОСТЬДАТ(&ТекущаяДата, BS_ЗарегистрированныеОбъектыБиллинга.ДатаОстановки, День) КАК День
			|ИЗ
			|	ВТНастройкиДнейОповещения КАК ВТНастройкиДнейОповещения
			|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.BS_ЗарегистрированныеОбъектыБиллинга КАК BS_ЗарегистрированныеОбъектыБиллинга
			|		ПО ВТНастройкиДнейОповещения.День = РАЗНОСТЬДАТ(&ТекущаяДата, BS_ЗарегистрированныеОбъектыБиллинга.ДатаОстановки,
			|			День)
			|ГДЕ
			|	BS_ЗарегистрированныеОбъектыБиллинга.Период <= &ТекущаяДата";
		
		Запрос.УстановитьПараметр("ТекущаяДата", ТекущаяДатаСеанса());
		Запрос.УстановитьПараметр("ВТНастройкиДнейОповещения", НастройкаДнейОповещений);
				
		РезультатЗапроса = Запрос.Выполнить();
		Если НЕ РезультатЗапроса.Пустой() Тогда
			Выборка = РезультатЗапроса.Выбрать();
			
			Пока Выборка.Следующий() Цикл
				ПараметрыСообщения = Новый Структура;
				ПараметрыСообщения.Вставить("ДополнительныеПараметры", Новый Структура);
				ПараметрыСообщения.Вставить("Шаблон", Шаблон);
				ПараметрыСообщения.Вставить("Предмет", Выборка.Объект);
				
				СформированноеСообщение = ШаблоныСообщенийСлужебный.СформироватьСообщение(ПараметрыСообщения);
			КонецЦикла;
		КонецЕсли;
		
		Токен = bs_РаботаСAPIВызовСервера.ПолучитьТокен(НастройкаБиллинга);

		МассивИдентификаторов = BS_БиллингВызовСервера.ПолучитьИдентификаторыПриложенийДляОстановки(Токен);
		Если МассивИдентификаторов.Количество() > 0 Тогда
			Метод = BS_ОбщегоНазначенияВызовСервераПовтИсп.ПолучитьМетодОстоновкиПриложения();
			Для каждого Идентификатор из МассивИдентификаторов Цикл
				МетодИдентификатора = СтрШаблон(Метод, Идентификатор);
				bs_РаботаСAPIВызовСервера.ВызватьМетодAPI(МетодИдентификатора, Токен,
											BS_ОбщегоНазначенияВызовСервераПовтИсп.HTTPМетоды().POST);
			КонецЦикла;
		КонецЕсли;
	КонецЕсли;
КонецПроцедуры

#КонецЕсли
